Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པས་མ་ཡིན་ནོ། །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བས་མ་ཡིན་ནོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་མ་ཡིན་ནོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་མ་ཡིན་ནོ། །ནང་སྟོང་པ་ཉིད་ཀྱིས་མ་ཡིན་ནོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱིས་མ་ཡིན་ནོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱིས་མ་ཡིན་ནོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པས་མ་ཡིན་ནོ།
en: Nor is it attained by means of feelings, perceptions, formative predispositions, or consciousness; nor by means of the sense fields, the sensory elements, or the links of dependent origination; nor by means of the perfection of generosity; nor by means of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom; nor by means of the emptiness of internal phenomena; nor by means of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; nor by means of the applications of mindfulness; nor by means of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path; nor by means of [the fruitional attributes and goals], up to and including all-aspect omniscience. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱིས་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གཟུགས་ཉིད་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: If you ask why, it is because the nature of physical forms is indeed all-aspect omniscience.

source: །ཚོར་བ་ཉིད་དང་། འདུ་ཤེས་ཉིད་དང་། འདུ་བྱེད་ཉིད་དང་། རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: The nature of feelings, perceptions, formative predispositions, and consciousness is indeed all-aspect omniscience.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཉིད་ཀྱི་བར་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: The nature [of all causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, is indeed all-aspect omniscience.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པའོ།
en: If you ask why, Subhūti, it is because the real nature of physical forms and the real nature of all-aspect omniscience are one and the same real nature.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པའོ།
en: The real nature of feelings, perceptions, formative predispositions, and consciousness, and the real nature of all-aspect omniscience, are one and the same real nature.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པའོ། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་།
en: The real nature of the sense fields, the sensory elements, and the links of dependent origination, and the real nature of all-aspect omniscience, are one and the same real nature.

source: ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་།
en: The real nature of all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment; the real nature of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; and the real nature of all-aspect omniscience, are one and the same real nature.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པའོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པའོ།
en: The real nature of the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, and the real nature of all-aspect omniscience, are one and the same real nature.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་སུམ་ཅུ་བདུན་པའོ།། །།
en: This completes the thirty-seventh chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ལྷ་རྫས་ཀྱི་ཙན་དན་གྱི་ཕྱེ་མ་དང་། ལྷ་རྫས་ཀྱི་མེ་ཏོག་ཨུཏྤལ་དང་། པད་མོ་དང་། ཀུ་མུད་དང་།
en: Chapter 38: [The Real Nature] Then the gods inhabiting the realm of desire and the realm of form brought many divine sandalwood powders, and divine blue lotuses, day lotuses, night lotuses, and white lotuses, and they scattered these toward the Blessed One.

source: བུན་ད་རི་ཀ་མང་པོ་ཁྱེར་ཏེ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་འཐོར་བར་གྱུར་ཏོ།
en: Having scattered them, {Ki.

source: །གཏོར་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: IV: 115} they approached the place where the Blessed One was seated, prostrated their heads at his feet, and took their place to one side.

source: །འཁོད་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལས་འདི་སྐད་དུ་གཟུགས་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གཟུགས་སོ།
en: Having taken their place to one side, those gods inhabiting the realm of desire and the realm of form then asked the Blessed One the following: “Blessed Lord, how do the tathāgatas, arhats, completely awakened buddhas teach, on the basis of this profound perfection of wisdom, that the nature of physical forms is all-aspect omniscience, and that all-aspect omniscience is indeed physical forms? [

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཉིད་རྣམ་པར་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པའོ།
en: How do they teach that] the nature of feelings, perceptions, formative predispositions, and consciousness is all-aspect omniscience, and that all-aspect omniscience is indeed consciousness [and so forth]? [

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའོ།
en: How do they teach that] the nature of the sense fields, the sensory elements, and the links of dependent origination is all-aspect omniscience, and that all-aspect omniscience is indeed the links of dependent origination [and so forth]? [

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: How do they teach that] the nature of the perfection of generosity is all-aspect omniscience, and that all-aspect omniscience is indeed the perfection of generosity? [

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ།
en: How do they teach that] the nature of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom is all-aspect omniscience, and that all-aspect omniscience is indeed the perfection of wisdom [and so forth]? [

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །ནང་སྟོང་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་ནང་སྟོང་པ་ཉིད་དོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ།
en: How do they teach that the nature of] the emptiness of internal phenomena is all-aspect omniscience, and that all-aspect omniscience is indeed the emptiness of internal phenomena? [

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དོ།
en: How do they teach that the nature of the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, is all-aspect omniscience, and that all-aspect omniscience is indeed the emptiness of the essential nature of nonentities [and so forth]? [

source: །དྲན་པ་ཉེ་བར་གཞག་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་དག་པ་ཉེ་བར་གཞག་པའོ།
en: How do they teach that] the nature of the applications of mindfulness is all-aspect omniscience, and that all-aspect omniscience is indeed the applications of mindfulness? [

source: །ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའོ།
en: How do they teach that] the nature of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path is all-aspect omniscience, and that all-aspect omniscience is indeed the noble eightfold path [and so forth]? [

source: །འཕགས་པའི་བདེན་པ་དད་བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའོ། །རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་།
en: How do they teach that] the nature of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions is all-aspect omniscience, and that all-aspect omniscience is indeed the formless absorptions [and so forth]? [

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའོ།
en: How do they teach that] the nature of the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas is all-aspect omniscience, and that all-aspect omniscience is indeed the distinct qualities of the buddhas [and so forth]? “[

source: །གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ། གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: How do they teach that] the real nature of physical forms and the real nature of all-aspect omniscience are one and the same real nature—that they are not two things and cannot be divided into two? [

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ། གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: How do they teach that] the real nature of feelings, perceptions, formative predispositions, and consciousness, and the real nature of all-aspect omniscience, are one and the same real nature—that they are not two things and cannot be divided into two? [

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ། གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: How do they teach that] the real nature of the sense fields, the sensory elements, and the links of dependent origination, and the real nature of all-aspect omniscience, are one and the same real nature—that they are not two things and cannot be divided into two? [

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ། གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: How do they teach that] the real nature of the perfection of generosity and the real nature of all-aspect omniscience are one and the same real nature—that they are not two things and cannot be divided into two. [

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ།
en: How do they teach that] the real nature of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, and the real nature of all-aspect omniscience, are one and the same real nature—that they are not two things and cannot be divided into two? [

source: གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ། །ནང་སྟོང་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ། གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: How do they teach that] the real nature of the emptiness of internal phenomena and the real nature of all-aspect omniscience are one and the same real nature—that they are not two things and cannot be divided into two. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ། གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: How do they teach that] the real nature of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, and the real nature of all-aspect omniscience, are one and the same real nature—that they are not two things and cannot be divided into two? [

source: །དྲན་པ་ཉེ་བར་གཞག་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ། གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ། །ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་།
en: How do they teach that] the real nature of the applications of mindfulness and the real nature of all-aspect omniscience are one and the same real nature—that they are not two things and cannot be divided into two? [

source: སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ། གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ། །འཕགས་པའི་བདེན་པ་དང་།
en: How do they teach that] the real nature of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path, and the real nature of all-aspect omniscience, are one and the same real nature—that they are not two things and cannot be divided into two? [

source: བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ། གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ། །རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་།
en: How do they teach that] the real nature of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions, and the real nature of all-aspect omniscience, are one and the same real nature—that they are not two things and cannot be divided into two? [

source: ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: How do they teach that] the real nature of the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas, and the real nature of all-aspect omniscience, are one and the same real nature—that they are not two things and cannot be divided into two? [

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ། གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། སངས་རྒྱས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་།
en: How do they teach that] the real nature of the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, the pratyekabuddhas, the bodhisattvas, and the buddhas, and the real nature of all-aspect omniscience, are one and the same real nature—that they are not two things and cannot be divided into two? “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ། གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ། །ཞེས་སྟོན་པ་ནི་འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བྱང་ཆུབ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཟབ་ཅིང་བལྟ་དཀའ་ལ་ཁོང་དུ་ཆུད་པར་དཀའ་ཞིང་བརྟག་ཏུ་མ་མཆིས་ལ་རྟོག་གེའི་སྤྱོད་ཡུལ་མ་ལགས་པ་སྟེ།
en: That is to say, this perfection of wisdom, the enlightenment of the tathāgatas, is profound, hard to see, and hard to comprehend.

source: ཞི་ཞིང་ཕྲ་བ་ཞིབ་མོ་མཁས་ཤིང་རྟོགས་པས་རིག་པར་བགྱི་བ་སྟེ།
en: It cannot be scrutinized; it is not within the range of sophistry. It is at peace, subtle, and delicate, and may be known by those who are learned and realized.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་ཡིད་ཆེས་པར་དཀའ་བའོ།
en: It is difficult for any mundane [beings] to have conviction in it.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ལྷའི་བུ་དག་དེ་དེ་བཞིན་ནོ།
en: The Blessed One then replied to those gods inhabiting the realm of desire and the realm of form, “Divine princes, it is so!

source: ལྷའི་བུ་དག་གཟུགས་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གཟུགས་སོ།
en: Divine princes, the nature of physical forms is all-aspect omniscience, and all-aspect omniscience is indeed physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པའོ།
en: The nature of feelings, perceptions, formative predispositions, and consciousness is all-aspect omniscience, and all-aspect omniscience is indeed consciousness [and so forth].

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Ki.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: IV: 116} The nature of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom is all-aspect omniscience, and all-aspect omniscience is indeed the perfection of wisdom [and so forth]. [

source: །ནང་སྟོང་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་ནང་སྟོང་པ་ཉིད་དོ།
en: The nature of] the emptiness of internal phenomena is all-aspect omniscience, and all-aspect omniscience is indeed the emptiness of internal phenomena. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དོ།
en: The nature of the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, is all-aspect omniscience, and all-aspect omniscience is indeed the emptiness of the essential nature of nonentities [and so forth].

source: །དྲན་པ་ཉེ་བར་གཞག་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་དྲན་པ་ཉེ་བར་གཞག་པའོ།
en: The nature of the applications of mindfulness is all-aspect omniscience, and all-aspect omniscience is indeed the applications of mindfulness.

source: །ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་ཉིད་ཀྱང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའོ།
en: The nature of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path is all-aspect omniscience, and all-aspect omniscience is indeed the noble eightfold path [and so forth].

source: །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའོ། །རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་།
en: The nature of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions is all-aspect omniscience, and all-aspect omniscience is indeed the formless absorptions [and so forth].

source: གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: The nature of the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas is all-aspect omniscience, and all-aspect omniscience is indeed the distinct qualities of the buddhas [and so forth]. “

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའོ། །གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ།
en: The real nature of physical forms and the real nature of all-aspect omniscience are one and the same real nature.

source: གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: They are not two things and cannot be divided into two.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ།
en: The real nature of feelings, perceptions, formative predispositions, and consciousness, and the real nature of all-aspect omniscience, are one and the same real nature.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་གཅིག་པ་སྟེ།
en: The real nature of the sense fields, the sensory elements, and the links of dependent origination, and the real nature of all-aspect omniscience, are one and the same real nature.
